package thread;

public class endingstory implements Runnable {

	@Override
	public void run() {
		Music ending = new Music("endingbgm.mp3", false);
		Thread op = new Thread(ending);
		op.start();
		try {
			Thread.sleep(3000);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}

		System.out.println("유희 : 내가 황금궤에 봉인해 두었던 카드는 죽은자의 소생");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("유희 : 너의 죽은자의 소생은 무효화가되");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 파트너는 나를 뛰어넘었다.");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 죽은자의 혼은 현세에 머물러선 안된다는 파트너의 메세지...");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 이별의 결의를 담은 파트너의 마지막 히든카드");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 와라 파트너");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("유희 : 사일런트 매지션으로 직접공격");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("유희 : (흐윽)");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 승자가 울면 어떻게해 파트너");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 많은것을 배웠어 파트너 상냥함의 힘을");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 파트너'싸움의 의식'을 받아들여준 용기 ");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 내가 앞으로 나아갈 길을 보여줬어");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 난 더이상 또 하나의 너가 아니야 파트너");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 내 이름은 아템 더이상 유우기가아니야");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : 유우기는 그 누구도 아닌 너 자신");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("유희 : 고마워 또하나의나 아니 아템");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("아템 : (지금 까지 고마웠어 파트너 그리고 모두들)");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("제작자 : 강지윤");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("원작 : 타카하시 카즈키");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println("Yu-Gi-Oh!");
		try {
			Thread.sleep(1500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
		System.out.println(
				"*************..........*.      .              **@********.***@@@@@@*.@@@@**....*.***@*** ..................***..*.*************\r\n"
						+ "*************..........*...    *@*.            **@**@@@@****@@@@@@...@@@@****@@@@@*@@**.............*********............******\r\n"
						+ "*************..........*.      .*@@*.           **@@*.**@@@@@@@@@*.**@@@@@@@@@@*.*@@**.............***************.......******\r\n"
						+ "*************..........*.      .****@@.          .**@@**..******@@**@@@*******.*@@***........************...***................\r\n"
						+ "*************..........*.      .******@**.         ***@@@*.****..@..@*..****.*@@@*******.*****....*................*.....\r\n"
						+ "*************.......*..*...    .*********@*.  ......****@*.*..***...**@.***@@@@*************...........................       .\r\n"
						+ "*************..........*. ..   .*************@@@**@@@@@@*........******..*.***@@@@@@@@@@@@******...............................\r\n"
						+ "*************..........*. .    .******************@@****.*....**.    .**..*.*****@@@@@@@@****..................................\r\n"
						+ ".......................*.      .*********************@@@********..  .****. ***@*******...........................  ............\r\n"
						+ ".......................*.      .************************@.*.*.*....  ..**.....@@*.*..***.......................................\r\n"
						+ ".......................* ...   .************.**...***@*..*..*    ..        ..*..*...... .......................................\r\n"
						+ ".......................*.       ...************...*...****..*.    ..     .@@@*..*... ...  .....................................\r\n"
						+ ".......................*. .     .   ..***********.*....*.**@.*@..   ...@@@*****.*........... ... ..     .......................\r\n"
						+ ".......................*.       ....   ..***********...*.**@*.*****@**** .***.***.......  ..     ..        ....................\r\n"
						+ ".......................*...     .   ....   ..***********..*@**@*@**@**@@**..***.*... ..  ..      ..       .....................\r\n"
						+ ".......................*... .   .      ....   ..***********@**@@*@*****@*******.***..**. ...     ..   . .......................\r\n"
						+ ".......................*...     ...        ....   .**.@@@@@******@@@@@@**@@@@@@@.*.*...*. .      .. ... ...........*...........\r\n"
						+ "......................... .     ..             ... .. **@@**@**@**@@@@@**@@@@@@*  *.***** *.     .. .   .........   ..\r\n"
						+ ".......................*.....     .               ..  .@@@@**@*****@@@@**@@@@@@.  .*. ... *...................** *********.***.\r\n"
						+ ".......................*. .    .*..               .    @@@@@@@**@****@**@@@@@@@    *......*.********..........** **************\r\n"
						+ ".......................*...    .******..          .    *@@@@@@@**@@@@*.@@@@@@@...**@***** *.********..*.......**\r\n"
						+ ".......................*...     ..***@*@***..    ..    .@@@@@@@**@@@@*@**@*@@@***@@@@**** *.....        . ....** .....\r\n"
						+ ".......................*....    **.....***@@@***..     .*@@@@@@@**@@**@@@@@@@****.. ..    *...      .. .......** .*************\r\n"
						+ ".......................*...    .********....****@     ...@@@@@@@@*@**@@@@@@@@**.     .    *.   .....  ........** .*************\r\n"
						+ ".......................*...     ************.....    ..**@@@*...****...*@@@@*.**.     *** *.********.***********.\r\n"
						+ "...........................     ************..**   ...***@@@***.****.*.*@@@@*. .....  .** *.********.***********.\r\n"
						+ ".......................*...... .************..*.     ...*@@@@@***.****@@@@@@*.  .      .. *...................**..*************\r\n"
						+ ".......................*....    ************..**      .*****.***************@...     .... *...................**..*************\r\n"
						+ ".......................*.... .  ************..***....**.*********************........**.. *.********.***********. .............\r\n"
						+ "............................ .  ************..********..*@@@**...*********@@@*.....*.**** *.********.******@@***...       .  ..\r\n"
						+ "............................ .  ************..***************.....***@@@@@@@@@***.**......**.*******..**********.\r\n"
						+ ".............................. .************..***.**************@@@*@@@@@@@@@@@@**.*......**.**...............**..*************\r\n"
						+ ".............................. .************..****...***@@@@@*@**@@@@@@@@@@@@@@@*..*.****.***@@@@*..*********.**. ***** *******\r\n"
						+ "............................ . .************..*****..*@*@@@@@@@@@@@@@@@@@@@@@@@@.*.*.****.********..*********..** ***** *******\r\n"
						+ "............................ . .************..*******.****@@@@@@@@@@@@@@@@@@@@@@.*.*.****.********.............** ***** *******");
		ending.close();

		System.exit(0);
	}

}
